# -*- coding: utf-8 -*-
"""
Created on Wed Apr 11 14:08:07 2018

@author: FZ
"""

# =============================================================================
#sorted 
# =============================================================================

print (sorted([12,87,54,98,32,45,65]))


#高阶函数
L1 = [12,-98,54,56,-78,-12,54,97,34,92,57,-19]
print (sorted(L1))
print (sorted(L1,key=abs))

L2 = ['bob','about','Zoo','Credit']
print (sorted(L2))#按ASCII码大小排序，'a'>'Z'
print (sorted(L2,key=str.lower,reverse=True))#降序

# =============================================================================
#excise 
# =============================================================================
#假设我们用一组tuple表示学生名字和成绩：
L3 = [('Bob', 75), ('Adam', 92), ('Bart', 66), ('Lisa', 88)]
#请用sorted()对上述列表分别按名字排序：

print (sorted(L3,key=lambda t:t[0]))
print (sorted(L3,key=lambda t:t[1],reverse=True))